<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Dropbox</string>
    <key>Identifier</key>
    <string>com.github.sthang50.download.Fetch</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fetch</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>http://fetchsoftworks.com/fetch/download/Fetch_5.7.5.dmg?direct=1</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "com.getFetch.Fetch"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
